<a href="https://colab.research.google.com/github/Jaomiew/Multivariate-Analysis/blob/main/Chapter1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Install Packages

In [1]:
install.packages("dplyr")
install.packages("tidyvers")

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

Warning message:
“package ‘tidyvers’ is not available for this version of R

A version of this package for your version of R might be available elsewhere,
see the ideas at
https://cran.r-project.org/doc/manuals/r-patched/R-admin.html#Installing-packages”

# Import libary

In [2]:
library(dplyr)
library(tidyr)

Attaching package: ‘dplyr’


The following objects are masked from ‘package:stats’:

    filter, lag


The following objects are masked from ‘package:base’:

    intersect, setdiff, setequal, union

# Create Data

In [3]:
df1 = data.frame(CustomerId = c(1:6),
                 Product = c("Refrigerator", "Microwave","Toaster","Rice cooker","Dishwasher","Coffee maker"))
df1

  CustomerId Product
1 1          Refrigerator
2 2          Microwave
3 3          Toaster
4 4          Rice cooker
5 5          Dishwasher
6 6          Coffee maker

In [4]:
df2 = data.frame(CustomerId = c(2, 4, 6, 7, 8),
                 State = c("New York","Washington","Texas","Nevada","Florida"))
df2

  CustomerId State
1 2          New York
2 4          Washington
3 6          Texas
4 7          Nevada
5 8          Florida

In [5]:
df3 = data.frame(CustomerId = c(10,30,100,50,60,70),
                 Product = c("Refrigerator", "Microwave","Toaster","Rice cooker","Dishwasher","Coffee maker"))
df3

  CustomerId Product
1  10        Refrigerator
2  30        Microwave
3 100        Toaster
4  50        Rice cooker
5  60        Dishwasher
6  70        Coffee maker

# Inner Join

In [6]:
df_ij1 = inner_join(df1,df2, by ='CustomerId')
df_ij1

  CustomerId Product      State
1 2          Microwave    New York
2 4          Rice cooker  Washington
3 6          Coffee maker Texas

In [7]:
df_ij2 = df1 %>% inner_join(df2,by="CustomerId")
df_ij2

  CustomerId Product      State
1 2          Microwave    New York
2 4          Rice cooker  Washington
3 6          Coffee maker Texas

# Outer Join

In [8]:
df_oj = full_join(x=df1,y=df2,by="CustomerId")
df_oj

  CustomerId Product      State
1 1          Refrigerator NA
2 2          Microwave    New York
3 3          Toaster      NA
4 4          Rice cooker  Washington
5 5          Dishwasher   NA
6 6          Coffee maker Texas
7 7          NA           Nevada
8 8          NA           Florida

# Left Join

In [9]:
df_lj = left_join(x=df1,y=df2,by="CustomerId")
df_lj

  CustomerId Product      State
1 1          Refrigerator NA
2 2          Microwave    New York
3 3          Toaster      NA
4 4          Rice cooker  Washington
5 5          Dishwasher   NA
6 6          Coffee maker Texas

# Right Join

In [10]:
df_right = right_join(x=df1,y=df2,by="CustomerId")
df_right

  CustomerId Product      State
1 2          Microwave    New York
2 4          Rice cooker  Washington
3 6          Coffee maker Texas
4 7          NA           Nevada
5 8          NA           Florida

# Show Result

In [11]:
df_oj %>% glimpse()

Rows: 8
Columns: 3
$ CustomerId <dbl> 1, 2, 3, 4, 5, 6, 7, 8
$ Product    <chr> "Refrigerator", "Microwave", "Toaster", "Rice cooker", "Dis…
$ State      <chr> NA, "New York", NA, "Washington", NA, "Texas", "Nevada", "F…

In [12]:
glimpse(df_oj)

Rows: 8
Columns: 3
$ CustomerId <dbl> 1, 2, 3, 4, 5, 6, 7, 8
$ Product    <chr> "Refrigerator", "Microwave", "Toaster", "Rice cooker", "Dis…
$ State      <chr> NA, "New York", NA, "Washington", NA, "Texas", "Nevada", "F…

# Missing Data

In [13]:
results = apply(is.na(df_lj),2,which)
results

$CustomerId
integer(0)

$Product
integer(0)

$State
[1] 1 3 5

In [14]:
df_md = drop_na(df_oj)
df_md

  CustomerId Product      State
1 2          Microwave    New York
2 4          Rice cooker  Washington
3 6          Coffee maker Texas